# Format is Key = (NativeErrorCode) Message. In all translations of this file,
# the (NativeErrorCode) _MUST_ be unmodified and _MUST_ be included.
INVALID_PROPMAP = (20000) La carte des propri\u00e9t\u00e9s est invalide ou introuvable.
PROP_NUMERIC_OVERFLOW = (20020) D\u00e9passement num\u00e9rique, impossible de d\u00e9finir une propri\u00e9t\u00e9 avec une valeur qui est trop grande.
PROP_VALTYPE_MISMATCH = (20040) Impossible de d\u00e9finir une propri\u00e9t\u00e9 avec une valeur d'un type qui n'est pas pr\u00e9vu ou acceptable pour la propri\u00e9t\u00e9.
INVALID_PROP_LIMITMAP = (20060) La carte des limites de propri\u00e9t\u00e9 est invalide ou introuvable.
INVALID_PROP_LIMITKEY = (20080) Les cl\u00e9s des limites de propri\u00e9t\u00e9 sont invalides or introuvables.
INVALID_PROPKEY = (20100) Propri\u00e9t\u00e9 {0} non prise en charge.
OPTIONAL_FEAT_NOT_IMPL = (20120) Propri\u00e9t\u00e9 {0} non prise en charge.
BAD_ATTR_VAL = (20140) La propri\u00e9t\u00e9 {0} ne peut pas prendre en charge la valeur {1}.
OPTIONAL_VAL_CHANGED = (20160)La propri\u00e9t\u00e9 {0} ne peut pas prendre en charge la valeur {1}, une valeur similaire l'a remplac\u00e9e temporairement. La valeur temporaire peut \u00eatre obtenue en r\u00e9cup\u00e9rant la valeur de la propri\u00e9t\u00e9.
NULL_PTR = (20180) Exception\u00a0: pointeur Null.
INVALID_ACTION_SQLENGINE = (20190) Action non valide pour SqlDataEngine, cette m\u00e9thode ne doit \u00eatre appel\u00e9e sur les IDataEngines que lorsque SQLEngine n'est pas utilis\u00e9.
INVALID_ROWNUM = (20200) Num\u00e9ro de ligne non valide.
INVALID_COLNUM = (20220) Num\u00e9ro de colonne invalide\u00a0: {0}
NOT_IMPLEMENTED = (20240) M\u00e9thode non impl\u00e9ment\u00e9e.
DEFAULT_LOGGING = (20260) Impossible d'acc\u00e9der aux fichiers \u00e0 utiliser pour les journaux\u00a0: {0}. Basculement sur la sortie de journalisation par d\u00e9faut.
REQ_SETTING_NOT_FOUND = (20280) Le param\u00eatre requis {0} n'est pas pr\u00e9sent dans les param\u00eatres de connexion.
DATA_TYPE_UNSUPPORTED = (20300) Type de donn\u00e9es non pris en charge\u00a0: {0} ({1})
DATA_TYPE_UNSUPPORTED_NUM = (20320) Type de donn\u00e9es non pris en charge\u00a0: {0}
DATA_TYPE_MISMATCH = (20340)Le type d'objet d\u00e9clar\u00e9, {0}, ne correspond pas au type de classe, {1}.
CURSOR_NOT_SUPPORTED = (20360) La direction de travers\u00e9e du jeu de r\u00e9sultats n'est pas prise en charge\u00a0: {0}
INVALID_METADATA_ID = (20380) ID de tableau de m\u00e9tadonn\u00e9es non valide\u00a0: {0}
PARAMS_IN_MULTI_STATEMENT = (20400) Plusieurs d\u00e9clarations ne peuvent pas contenir de param\u00eatres.
CANNOT_CREATE_LOGGING_PATH = (20420) Le chemin du fichier de journal n'existe pas et ne peut pas \u00eatre cr\u00e9\u00e9\u00a0: {0}
INVALID_WRITEDATA_OFFSET = (20440) D\u00e9calage non valide, {0}, d\u00e9tect\u00e9 dans la m\u00e9thode {1}.writeData().
INVALID_STMT_IN_BATCH = (20460) D\u00e9claration non valide dans le lot\u00a0: {0}
INVALID_NULL_ARG = (20480) Argument non valide\u00a0: {0} ne peut pas \u00eatre nul.
INVALID_PUSHED_DEFAULT_PARAM = (20500) Les param\u00e8tres d'entr\u00e9e par d\u00e9faut ne peuvent pas \u00eatre transf\u00e9r\u00e9s.
GENERATED_TOKEN_LENGTH = (20520) Longueur du jeton g\u00e9n\u00e9r\u00e9e depuis initSecContext\u00a0: {0}.
SERVER_NAME_RETURNED_BY_GSS = (20540) Le nom de serveur renvoy\u00e9 par GSS est\u00a0: {0}.
# MAINTENANCE NOTE: This translation needs to be reviewed.
SORTING_ERROR = (20560) Erreur inattendue lors du tri des m\u00e9tadonn\u00e9es.
# MAINTENANCE NOTE: This translation needs to be reviewed.
APPNAME_CLIENT_INFO_PROPERTY_DESC = (20580) Le nom de l'application utilisant actuellement la connexion.
# MAINTENANCE NOTE: This translation needs to be reviewed.
USER_CLIENT_INFO_PROPERTY_DESC = (20600) Le nom de l'utilisateur pour lequel l'application utilisant la connexion ex\u00e9cute un travail.
# MAINTENANCE NOTE: This translation needs to be reviewed.
HOSTNAME_CLIENT_INFO_PROPERTY_DESC = (20620) Le nom d'h\u00f4te de l'ordinateur sur lequel l'application utilisant la connexion op\u00e8re.
NUMERIC_OVERFLOW = (20630) D\u00e9passement num\u00e9rique. Vous ne pouvez pas cr\u00e9er de m\u00e9tadonn\u00e9es pour la valeur d'entr\u00e9e.
FEATURE_NOT_SUPPORTED = (20640) Fonctionnalit\u00e9 non prise en charge\u00a0: {0}.
INVALID_METADATA_COLUMN_TAG = (20650) Balise de colonne de m\u00e9tadonn\u00e9es non valide\u00a0: {0}.
