# Format is Key = (NativeErrorCode) Message. In all translations of this file,
# the (NativeErrorCode) _MUST_ be unmodified and _MUST_ be included.
BATCH_NOT_EMPTY = (10000) El lote se debe ejecutar con executeBatch() o borrar con clearBatch().
COLUMN_DISPLAY_OVERFLOW = (10020) Desbordamiento num\u00e9rico en el tama\u00f1o de visualizaci\u00f3n de columna para el tama\u00f1o: {0}.
COMMIT_AUTOCOMMIT = (10040) No se puede confirmar mientras la conexi\u00f3n est\u00e1 en el modo de confirmaci\u00f3n autom\u00e1tica.
CONNECTION_CLOSED = (10060) La conexi\u00f3n se ha cerrado.
CONNECTION_OPEN = (10080) El administrador de cola abri\u00f3 de nuevo una conexi\u00f3n ya abierta.
CONNECTION_REFUSED = (10100) Conexi\u00f3n rechazada: {0}
CONVERSION_ERROR_INPUT_PARAM = (10120) Error al convertir los datos; tipo no v\u00e1lido para el par\u00e1metro: {0}.
CONVERT_TO_ERR = (10140) Error al convertir el valor a {0}.
CONVERT_UTF_SUPPORT = (10160) Java no admite la codificaci\u00f3n UTF-8.
CURSOR_AFTER_LAST_ROW = (10170) Error al cargar los datos; el cursor est\u00e1 situado despu\u00e9s de la \u00faltima fila.
CURSOR_BEFORE_FIRST_ROW = (10180) Error al cargar los datos; el cursor est\u00e1 situado antes de la primera fila.
DATA_TRUNCATED_ERR = (10200) Truncamiento de cadena o datos binarios por la derecha para la columna {0}.
DRIVER_NOT_CAPABLE = (10220) El controlador no es compatible con esta caracter\u00edstica opcional.
# MAINTENANCE NOTE: This translation needs to be reviewed.
FEATURE_NOT_SUPPORTED = (10221) La caracter\u00edstica: "{0}" no es compatible con la configuraci\u00f3n actual del controlador JDBC. 
INITIALIZE_FACTORY = (10260) Se ha devuelto un generador de objetos JDBC nulo. Se debe devolver un generador de objetos JDBC v\u00e1lido a trav\u00e9s de createJDBCObjectFactory().
INTERVAL_FIELD_OVERFLOW = (10280) Desbordamiento del campo de intervalo.
INVALID_ACTION_ON_INSERT_ROW = (10300) Solo se puede llamar a los m\u00e9todos updater, getter e insertRow encontr\u00e1ndose en la fila de inserci\u00f3n.
INVALID_ATTRIBUTE = (10320) Atributo personalizado no v\u00e1lido. {0}.
INVALID_COLUMN_INDEX = (10340) \u00cdndice de columna no v\u00e1lido: {0}.
INVALID_COLUMN_NAME = (10360) No se encuentra el nombre de columna: {0}.
INVALID_COLUMN_SET_TYPE = (10380) Tipo de columna no v\u00e1lido para la columna: {0}.
INVALID_COLUMN_TYPE = (10400) Tipo no v\u00e1lido de datos; columna: {0}; tipo: {1}.
INVALID_CURSOR_TRANSITION = (10440) Transici\u00f3n de cursor inv\u00e1lida: En la \u00faltima fila con m\u00e1s filas sobrantes.
INVALID_FETCH_SIZE = (10460) tama\u00f1o de carga no v\u00e1lido: {0}. Intervalo de tama\u00f1os v\u00e1lido: de {1} a {2}.
INVALID_FIELD_SIZE = (10480) tama\u00f1o de campo no v\u00e1lido: {0}. Intervalo de tama\u00f1os v\u00e1lido: de {1} a {2}.
INVALID_FORWARDONLY_ACTION = (10500) Operaci\u00f3n no v\u00e1lida para ResultSets solo hacia delante.
INVALID_GET_UPDATE_STREAM = (10520) Acci\u00f3n no v\u00e1lida; las columnas actualizadas como flujos no se pueden cargar antes de insertRow() o updateRow().
INVALID_INTERVAL_DATA_TYPE = (10540) Tipo de datos de intervalo no v\u00e1lido.
INVALID_INTERVAL_DAY_FORMAT = (10560) Formato de intervalo de d\u00edas no v\u00e1lido: "{0}". El valor debe tener el formato "DD".
INVALID_INTERVAL_DAY_HOUR_FORMAT = (10580) Formato de intervalo de d\u00edas hasta horas no v\u00e1lido: "{0}". El valor debe tener el formato "DD HH".
INVALID_INTERVAL_DAY_MINUTE_FORMAT = (10600) Formato de intervalo de d\u00edas hasta minutos no v\u00e1lido: "{0}". El valor debe tener el formato "DD HH:mm".
INVALID_INTERVAL_DAY_SECOND_FORMAT = (10620) Formato de intervalo de d\u00edas hasta segundos no v\u00e1lido: "{0}". El valor debe tener el formato "DD HH:mm:SS[.fffffffff]".
INVALID_INTERVAL_HOUR_FORMAT = (10640) Formato de intervalo de horas no v\u00e1lido: "{0}". El valor debe tener el formato "HH".
INVALID_INTERVAL_HOUR_MINUTE_FORMAT = (10660) Formato de intervalo de horas hasta minutos no v\u00e1lido: "{0}". El valor debe tener el formato "HH:mm".
INVALID_INTERVAL_HOUR_SECOND_FORMAT = (10680) Formato de intervalo de horas hasta segundos no v\u00e1lido: "{0}". El valor debe tener el formato "HH:mm:SS[.fffffffff]".
INVALID_INTERVAL_MINUTE_FORMAT = (10700) Formato de intervalo de minutos no v\u00e1lido: "{0}". El valor debe tener el formato "mm".
INVALID_INTERVAL_MINUTE_SECOND_FORMAT = (10720) Formato de intervalo de minutos hasta segundos no v\u00e1lido: "{0}". El valor debe tener el formato "mm:SS[.fffffffff]".
INVALID_INTERVAL_MONTH_FORMAT = (10740) Formato de intervalo de meses no v\u00e1lido: "{0}". El valor debe tener el formato "MM".
INVALID_INTERVAL_SECOND_FORMAT = (10760) Formato de intervalo de segundos no v\u00e1lido: "{0}". El valor debe tener el formato "SS[.fffffffff]".
INVALID_INTERVAL_YEAR_FORMAT = (10780) Formato de intervalo de a\u00f1os no v\u00e1lido: "{0}". El valor debe tener el formato "AAAA".
INVALID_INTERVAL_YEAR_MONTH_FORMAT = (10800) Valor de intervalo de a\u00f1os hasta mes no v\u00e1lido: "{0}". El valor debe tener el formato "AAAA-MM".
INVALID_MORERESULTS_VALUE = (10820) Se ha pasado un valor no v\u00e1lido a getMoreResults(): "{0}".
INVALID_NULL_INSERT = (10840) No se puede insertar un valor nulo en la columna {0}, porque est\u00e1 marcada como no anulable.
INVALID_NULL_UPDATE = (10860) No se puede establecer un valor nulo para la columna {0}, porque est\u00e1 marcada como no anulable.
INVALID_NUMBER_METADATA = (10880) Al cargar los metadatos se han creado varios resultados o ninguno.
INVALID_NUMBER_PARAMS = (10900) No se han introducido todos los par\u00e1metros.
INVALID_OUTPUT_INDEX = (10920) No se encuentra ning\u00fan valor de salida para el \u00ed\u00adndice de par\u00e1metros: {0}.
INVALID_PARAM_INDEX = (10940) \u00cdndice de par\u00e1metros no v\u00e1lido: {0}.
INVALID_PARAM_INPUT_ONLY = (10960) Tipo de par\u00e1metro no v\u00e1lido para el par\u00e1metro: {0}. Solo se admiten par\u00e1metros de entrada para PreparedStatement.
INVALID_PARAM_NAME = (10980) No se encuentra el nombre de par\u00e1metro: {0}.
INVALID_PARAM_OBJECT = (11000) Objeto no v\u00e1lido para el par\u00e1metro: {0}.
INVALID_PARAM_SET_TYPE = (11020) Tipo de par\u00e1metro no v\u00e1lido para el par\u00e1metro: {0}.
INVALID_PARAM_TYPE = (11040) Tipo no v\u00e1lido para los datos - par\u00e1metro: {0}; tipo: {1}.
INVALID_READONLY_ACTION = (11060) Operaci\u00f3n no v\u00e1lida para ResultSets de solo lectura.
INVALID_REGISTER_TYPE = (11080) No se puede registrar el par\u00e1metro de entrada: {0}.
INVALID_RETRIEVE_TYPE = (11100) El par\u00e1metro {0} es un par\u00e1metro de entrada.
INVALID_MAX_ROW = (11120) tama\u00f1o de fila m\u00e1ximo no v\u00e1lido: {0}. Intervalo v\u00e1lido: de {1} a {2}.
INVALID_SAVEPOINT = (11140) Punto de retorno no v\u00e1lido. El punto de retorno se debe crear desde la conexi\u00f3n en la que se emplea y dentro de la transacci\u00f3n en la que se crea.
INVALID_SCALE = (11160) Escala no v\u00e1lida: {0}. Valor m\u00ednimo: {1}.
INVALID_SET_TYPE = (11180) No se puede establecer el par\u00e1metro de salida: {0}.
INVALID_STMT_ACTION = (11200) Operaci\u00f3n no v\u00e1lida para este objeto de declaraci\u00f3n.
INVALID_STMT_PARAM = (11220) Los par\u00e1metros no se pueden usar con objetos Statement normales; utilice PreparedStatements en su lugar.
INVALID_TIMEOUT = (11240) Tiempo de espera no v\u00e1lido: {0}. Intervalo de tiempo de espera v\u00e1lido: de {1} a {2}.
INVALID_URL = (11260) URL de conexi\u00f3n no v\u00e1lida.
INVALID_VERSION = (11280) Versi\u00f3n no v\u00e1lida devuelta: {0}.
LICENSE_NOT_BEGUN = (11284) El periodo de evaluaci\u00f3n no ha comenzado a\u00fan; se iniciar\u00e1 el {0}. P\u00f3ngase en contacto con Simba Technologies Inc. mediante sales@simba.com.
LICENSE_EXPIRED = (11285) El periodo de evaluaci\u00f3n expir\u00f3 el {0}. P\u00f3ngase en contacto con Simba Technologies Inc. mediante sales@simba.com.
LICENSE_FILE_CORRUPTED = (11286) El archivo de licencia "{0}" est\u00e1 da\u00f1ado. P\u00f3ngase en contacto con su administrador o con Simba Technologies Inc. mediante sales@simba.com.
LICENSE_READ_ERROR = (11286) Error al leer el archivo de licencia "{0}". Verifique la existencia del archivo y que se le hayan otorgado permisos.
NO_RESULTSET_GENERATED = (11300) Se esperaba un ResultSet, pero no fue generado por la consulta "{0}". La consulta no se ha ejecutado. 
NO_ROWCOUNT_GENERATED = (11320) Se esperaba un recuento de filas, pero no fue generado por la consulta "{0}". La consulta no se ha ejecutado. 
NOT_OUTPUT_REGISTERED = (11340) No se han registrado todos los par\u00e1metros de salida.
NULL_CALENDAR_PARAM = (11360) Datos no v\u00e1lidos proporcionados para el calendario.
NULL_ERROR = (11380) Excepci\u00f3n de puntero nulo.
NULL_METADATA_COLUMNMAP = (11400) Informaci\u00f3n de asignaci\u00f3n de columnas de metadatos nula.
NULL_PARAM_METADATA = (11420) Error: no se han introducido los metadatos de par\u00e1metro.
NULL_SQL_STRING = (11440) Se ha pasado una cadena SQL nula para su ejecuci\u00f3n.
ONE_RESULT_NOT_RETURNED = (11460) Se esperaba exactamente un resultado, pero {0} se generaron resultados a partir de la consulta "{1}". La consulta no se ha ejecutado.
OPTIONAL_KEYS_MSG = (11480) Clave(s) de conexi\u00f3n opcional(es)
PARAM_OBJECT_MISMATCH = (11500) El tipo proporcionado no coincide con el objeto dado: {0}.
PARAM_NOT_NULLABLE = (11520) El par\u00e1metro {0} no se puede anular.
PROCESSED_KEYS_MSG = (11540) Clave(s) de conexi\u00f3n procesada(s)
REGISTER_DRIVER = (11560) Se produjo un error de acceso a la base de datos durante el registro del controlador.
RESULT_DELETE_NOT_SUPPORTED = (11580) No se admiten las eliminaciones para conjuntos de resultados de lectura-escritura.
RESULT_INSERT_NOT_SUPPORTED = (11600) No se admiten las inserciones para conjuntos de resultados de lectura-escritura.
RESULT_UPDATE_NOT_SUPPORTED = (11620) No se admiten las actualizaciones para conjuntos de resultados de lectura-escritura.
REQUIRED_KEYS_MSG = (11640) Clave(s) de conexi\u00f3n requerida(s)
RESULTSET_RETURNED = (11660) La consulta devuelve un ResultSet cuando se espera un recuento de filas.
ROLLBACK_AUTOCOMMIT = (11680) No se puede revertir mientras la conexi\u00f3n est\u00e1 en el modo de confirmaci\u00f3n autom\u00e1tica.
SAVEPOINT_AUTOCOMMIT = (11700) No se puede establecer un punto de retorno mientras la conexi\u00f3n est\u00e1 en el modo de confirmaci\u00f3n autom\u00e1tica.
SAVEPOINT_ID_FROM_NAMED = (11720) No se puede recuperar el ID num\u00e9rico del punto de retorno con nombre.
SAVEPOINT_NAMED_FROM_ID = (11740) No se puede recuperar el nombre del punto de retorno sin nombre.
SETREADONLY_IN_TRANSACTION = (11760) No se puede llamar a setReadOnly mientras la conexi\u00f3n est\u00e1 en una transacci\u00f3n.
TRANSACTION_ALREADY_STARTED = (11780) La transacci\u00f3n ya ha comenzado.
TRANSACTION_CALLBACKS_NOT_ALLOWED = (11800) Las llamadas de devoluci\u00f3n de transacci\u00f3n no se permiten durante las llamadas de transacci\u00f3n de API JDBC expl\u00edcitas.
UNKNOWN_CURSOR_POSITION = (11820) Posici\u00f3n del cursor desconocida: {0}.
UNKNOWN_DATA_TYPE = (11840) Tipo de datos desconocido: {0}.
UNKNOWN_FETCH_DIRECTION = (11860) Direcci\u00f3n de carga desconocida: {0}.
UNKNOWN_HOLDABILITY = (11880) Capacidad de alojamiento de ResultSet desconocida: {0}.
UNKNOWN_ISOLATION = (11900) Nivel de aislamiento de transacci\u00f3n desconocido: {0}.
UNKNOWN_METADATA_TYPE = (11920) Tipo de metadatos desconocido: {0}.
UNKNOWN_SCOPE = (11940) \u00c1mbito desconocido: {0}.
UNKNOWN_SQLSTATE_TYPE = (11960) Tipo de SQLState desconocido: {0}.
UNSUPPORTED_HOLDABILITY = (11970) Capacidad de alojamiento no admitida: {0}.
UNSUPPORTED_TXN_ISOLATION = (11975) Nivel de aislamiento de transacci\u00f3n no admitido: {0}.

DBMETA_CLOSED = (11980) El objeto DatabaseMetaData se ha cerrado.
PARAMMETA_CLOSED = (12000) El objeto ParameterMetaData se ha cerrado.
PARENT_CLOSED = (12020) El primario se ha cerrado; el objeto no es v\u00e1lido.
RESULTMETA_CLOSED = (12040) El objeto ResultSetMetaData se ha cerrado.
RESULTSET_CLOSED = (12060) El objeto ResultSet se ha cerrado.
STATEMENT_CLOSED = (12080) El objeto Statement se ha cerrado.

STREAM_CLOSED = (12100) Flujo cerrado; acci\u00f3n no v\u00e1lida.
STREAM_CORRUPT_UTF = (12120) Valor de byte UTF da\u00f1ado.
STREAM_EMPTY = (12140) No hay m\u00e1s datos que leer en el flujo.
STREAM_INVALID_BUFFER = (12160) B\u00fafer de caracteres no v\u00e1lido: nulo.
STREAM_INVALID_OFFSET = (12180) Desplazamiento no v\u00e1lido: {0}. Los valores se pueden encontrar entre 0 y {1}.
STREAM_READ_ERROR = (12200) Error al leer datos en el origen de datos: {0}
# MAINTENANCE NOTE: This translation needs to be reviewed.
STREAM_REUSED = (12330) Operaci\u00f3n ilegal. Intent\u00f3 volver a usar un InputStream.
STREAM_UNEXPECTED_END = (12220) Se alcanz\u00f3 el fin del flujo de forma inesperada.

WARN_DDL_IGNORED = (12240) La declaraci\u00f3n DDL de la transacci\u00f3n se ignor\u00e1 porque SQL_TXN_CAPABLE es SQL_TC_DDL_IGNORE.
WARN_DDL_FORCE_COMMIT = (12260) La declaraci\u00f3n DDL forzar\u00e1 la confirmaci\u00f3n de la transacci\u00f3n porque SQL_TXN_CAPABLE es SQL_TC_DDL_COMMIT.
WARN_FRACTIONAL_TRUNC = (12280) Truncamiento fraccional de n\u00famero.

# MAINTENANCE NOTE: These translations need to be reviewed.
INVALID_FETCH_SIZE_UNLIMITED_MAX = (12300) tama\u00f1o de carga no v\u00e1lido: {0}. tama\u00f1o debe ser de al menos 0.
OPERATION_CANCELED = (12310) La operaci\u00f3n fue cancelada.
STREAM_METADATA_SET_ERROR = (12320) No se puede definir metadatos para la corriente despu\u00e9s de que se hayan recuperado los valores.
CONNECTION_WRONG_PROPS = (12330) No se puede establecer una conexi\u00f3n exitosa con propiedades dadas.
